; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image0 - mode
	image1 - mode
	GroundStation4 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation11 - direction
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation10 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	Star6 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 image1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet16)
	(supports instrument3 image1)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image0)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation11)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation8)
	(supports instrument6 image1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation10)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation7)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 Star6)
	(calibration_target instrument7 GroundStation5)
	(supports instrument8 image0)
	(supports instrument8 image1)
	(calibration_target instrument8 Star6)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon15)
)
(:goal (and
	(pointing satellite1 Planet13)
	(have_image Star12 image0)
	(have_image Planet13 image0)
	(have_image Phenomenon14 image1)
	(have_image Phenomenon15 image0)
	(have_image Planet16 image1)
	(have_image Star17 image0)
))

)

; plan
1. (turn_to satellite1 groundstation3 groundstation8)
   deleted: (pointing satellite1 groundstation8)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 7
2. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 7
3. (calibrate satellite1 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 0 of 7
4. (turn_to satellite1 planet16 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet16)
   goals met: 0 of 7
5. (take_image satellite1 planet16 instrument5 image1)
   added: (have_image planet16 image1)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon15 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 phenomenon15)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon15 instrument5 image0)
   added: (have_image phenomenon15 image0)
   goals met: 2 of 7
8. (turn_to satellite1 phenomenon14 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon14)
   goals met: 2 of 7
9. (take_image satellite1 phenomenon14 instrument5 image1)
   added: (have_image phenomenon14 image1)
   goals met: 3 of 7
10. (turn_to satellite1 star12 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 star12)
   goals met: 3 of 7
11. (take_image satellite1 star12 instrument5 image0)
   added: (have_image star12 image0)
   goals met: 4 of 7
12. (turn_to satellite1 star17 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star17)
   goals met: 4 of 7
13. (take_image satellite1 star17 instrument5 image0)
   added: (have_image star17 image0)
   goals met: 5 of 7
14. (turn_to satellite1 planet13 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 planet13)
   goals met: 6 of 7
15. (take_image satellite1 planet13 instrument5 image0)
   added: (have_image planet13 image0)
   goals met: 7 of 7
